Revit 2025 API
LightGroup Class
 This class represents a set of lights grouped together for easier management of various lighting scenarios
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightGroup
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class LightGroup : IDisposable
Public Class LightGroup
	Implements IDisposable
public ref class LightGroup : IDisposable
type LightGroup =
    class
        interface IDisposable
    end
The LightGroup type exposes the following members.
Properties
Name | Description
Id |  The ElementId of the LightGroup
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the LightGroup
Top
Methods
Name | Description
AddLight |  Add a new light instance to the group
Dispose | Releases all resources used by the LightGroup
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLights |  Get the set of contained light instances The set of light instances
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveLight |  Remove the given light instance from the set of light instances in this group
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Example
public void AddRemoveLightInGroup(LightGroup groupOne, LightGroup groupTwo, FamilyInstance lightOne, FamilyInstance lightTwo)
{
    // Add two lights into groupOne.
    groupOne.AddLight(lightOne.Id);
    groupOne.AddLight(lightTwo.Id);
    // Move a light from groupOne to groupTwo
    groupTwo.AddLight(lightOne.Id);
    // Retrieve the added lights in the group
    ICollection<ElementId> existingLightIds = groupOne.GetLights();
    // remove the light
    groupOne.RemoveLight(lightTwo.Id);
}
Public Sub AddRemoveLightInGroup(groupOne As LightGroup, groupTwo As LightGroup, lightOne As FamilyInstance, lightTwo As FamilyInstance)
   ' Add two lights into groupOne.
   groupOne.AddLight(lightOne.Id)
   groupOne.AddLight(lightTwo.Id)
   ' Move a light from groupOne to groupTwo
   groupTwo.AddLight(lightOne.Id)
   ' Retrieve the added lights in the group
   Dim existingLightIds As ICollection(Of ElementId) = groupOne.GetLights()
   ' remove the light
   groupOne.RemoveLight(lightTwo.Id)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace